{"class_name": "Sequential", "keras_version": "2.3.1", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv3D", "config": {"data_format": "channels_last", "activation": "linear", "batch_input_shape": [null, 30, 30, 30, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 32, "kernel_size": [5, 5, 5], "use_bias": true, "name": "conv3d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "dtype": "float32", "strides": [2, 2, 2]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 0.001, "center": true, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612, "dtype": "float32"}}, {"class_name": "Conv3D", "config": {"data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 32, "use_bias": true, "name": "conv3d_2", "kernel_size": [3, 3, 3], "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1, 1], "dtype": "float32", "strides": [1, 1, 1]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 0.001, "center": true, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612, "dtype": "float32"}}, {"class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2, 2], "name": "max_pooling3d_1", "padding": "valid", "dtype": "float32", "strides": [2, 2, 2]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 128, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 0.001, "center": true, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 10, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32"}}]}}