{"keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv3D", "config": {"dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "name": "conv3d_1", "kernel_size": [3, 3, 3], "data_format": "channels_last", "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "padding": "valid", "activation": "linear", "filters": 32, "batch_input_shape": [null, 30, 30, 30, 1], "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "name": "batch_normalization_1", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling3D", "config": {"dtype": "float32", "pool_size": [2, 2, 2], "trainable": true, "name": "max_pooling3d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2, 2]}}, {"class_name": "Conv3D", "config": {"dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv3d_2", "kernel_size": [3, 3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 32, "use_bias": true, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "name": "batch_normalization_2", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Conv3D", "config": {"dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv3d_3", "kernel_size": [3, 3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 32, "use_bias": true, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "name": "batch_normalization_3", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling3D", "config": {"dtype": "float32", "pool_size": [2, 2, 2], "trainable": true, "name": "max_pooling3d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2, 2]}}, {"class_name": "Dropout", "config": {"dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5}}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"dtype": "float32", "activity_regularizer": null, "trainable": true, "name": "dense_1", "kernel_constraint": null, "units": 2048, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "name": "batch_normalization_4", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dense", "config": {"dtype": "float32", "activity_regularizer": null, "trainable": true, "name": "dense_2", "kernel_constraint": null, "units": 10, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}], "name": "sequential_1"}}