{"config": {"layers": [{"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 64, "batch_input_shape": [null, 30, 30, 30], "padding": "valid", "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "momentum": 0.99, "center": true, "scale": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dtype": "float32", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "activation": "linear", "bias_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 64, "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "momentum": 0.99, "center": true, "scale": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "activation": "linear", "bias_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 32, "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "momentum": 0.99, "center": true, "scale": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "activation": "linear", "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "units": 2048}, "class_name": "Dense"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "momentum": 0.99, "center": true, "scale": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "activation": "softmax", "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "units": 10}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow"}